package com.ruoyi.web.zy.common;

public enum ErrorCode {

    /**
     * 功能对应编码：
     * 10000：系统成功编码
     * 20000-29999：公共信息编码
     * 30000-49999：财务后台编码
     * 50000-79999：产品信息编码
     * 80000-99999：金流信息编码
     */

    SC_10000("10000", "请求成功"),

    SC_10001("10001", "请求失败"),

    SC_20000("20000", "商户不存在"),
    SC_20001("20001", "下单金额错误"),
    SC_20002("20002", "商户验签失败"),
    SC_20003("20003", "收存款不存在"),

    SC_30000("30000", "验证码错误"),
    SC_30001("30001", "用户名或密码错误"),
    SC_30002("30002", "账号已被暂停使用"),
    SC_30003("30003", "编码已存在"),
    SC_30004("30004", "系统参数类别和编码已存在"),
    SC_30005("30005", "解析文档未能获取有效数据"),
    SC_30006("30006", "未登录或登录超时"),
    SC_30007("30007", "输入密码与当前密码不一致"),
    SC_30008("30008", "新密码不能为空"),
    SC_30009("30009", "两次输入的新密码不一致"),

    SC_50000("50000", "未找到相应的记录"),
    SC_50001("50001", "未找到相应的配置信息"),
    SC_50002("50002", "检查游戏账号失败"),
    SC_50003("50003", "获取令牌失败"),
    SC_50004("50004", "接口返回值为空"),
    SC_50005("50005", "接口返回值错误"),
    SC_50006("50006", "游戏已被删除，请联系客服核对后再进行操作"),
    SC_50007("50007", "游戏已被下架，请联系客服核对后再进行操作"),
    SC_50008("50008", "未找到相应的游戏开关，请联系客服核对后再进行操作"),
    SC_50009("50009", "%s游戏正在维护中，维护时间：%s 至 %s"),
    SC_50010("50010", "登录游戏失败"),
    SC_50011("50011", "查询时间区间不得大于30天"),
    SC_50012("50012", "请求第三方异常"),


    SC_70000("70000", "传递参数错误"),
    SC_70001("70001", "秒付宝回调出现异常"),
    SC_70002("70002", "秒付宝提款出现异常"),
    SC_80000("80000", "金流中心渠道分配逻辑异常"),
    SC_80001("80001", "金流中心取消订单异常"),
    SC_80002("80002", "该笔订单已经被处理过了"),
    SC_80003("80003", "通知时发生异常"),
    SC_80004("80004", "找不到付款卡信息"),
    SC_80005("80005", "付款卡不允许重复"),
    SC_80006("80006", "更新银行卡时出现异常"),
    SC_80007("80007", "更新银行卡额度出现异常"),
    SC_80008("80008", "请输入正确的银行账户信息"),
    SC_80009("80009", "新增银行转账提案发生异常"),
    SC_80010("80010", "转出数量必须大于0笔"),
    SC_80011("80011", "转出金额必须大于0"),
    SC_80012("80012", "费率不能小于0"),
    SC_80013("80013", "费率不能大于1000"),
    SC_80014("80014", "提案不能为空"),
    SC_80015("80015", "提案状态不为未审核"),
    SC_80016("80016", "审核提案发生异常"),
    SC_80017("80017", "执行提案发生异常"),
    SC_80018("80018", "取消提案发生异常"),
    SC_80019("80019", "提案状态不为已审核"),
    SC_80020("80020", "不能取消已执行或已取消的提案"),
    SC_80021("80021", "出款卡异常"),
    SC_80022("80022", "入款卡异常"),
    SC_80023("80023", "手续费不能大于金额"),
    SC_80024("80024", "转成功时出现异常"),
    SC_80025("80025", "转失败时出现异常"),
    SC_80026("80026" , "找不到付款订单号"),
    SC_80027("80027" , "订单已存在"),
    SC_80028("80028" , "找不到订单对应的产品编码"),
    SC_80029("80029" , "已经存在黑名单记录"),

    SC_90003("90003", "未找到相应的通道"),
    SC_90001("90001", "未匹配到相应通道"),
    SC_90002("90002", "已经存在对应栏目排序");

    // 编码
    private String code;
    // 消息
    private String message;

    private ErrorCode(String code, String message) {
        this.code = code;
        this.message = message;
    }

    public String getCode() {
        return code;
    }

    public void setCode(String code) {
        this.code = code;
    }

    public String getMessage() {
        return message;
    }

    public void setMessage(String message) {
        this.message = message;
    }
}
